app/views/employees/_form.html.erb

SELECT "employees".* FROM "employees"
SELECT "offices".* FROM "offices"
---
    <%= f.label :office %><br />
    <%= collection_select(:employee, :office_id, Office.all, :id, :name) %>