app/views/employees/index.html.erb

SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT 1  [["id", "1"]]
---
<h1>
  <%= @employees.first.office.name %>