app/controllers/employees_controller.rb

  def index
  if params[:office_id].nil?
    @employees = Employee.all
  else
    @office = Office.find(params[:office_id])
---
SELECT "employees".* FROM "employees"
SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT 1  [["id", "1"]]

  def new
  if params[:office_id].nil?
    @employee = Employee.new
    @back = employees_path
  else
    @office = Office.find(params[:office_id])
---
SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @employee = Employee.find(params[:id])
    if params[:office_id].nil?
      @back = employees_path
    else
      @back = Office.find(params[:office_id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "offices".* FROM "offices" WHERE "offices"."id" = 2 LIMIT 1

  def create
  if params[:office_id].nil?
    @employee = Employee.new(params[:employee])
  else
    @office = Office.find(params[:office_id])
    @employee = @office.employees.new(params[:employee])
  end

    respond_to do |format|
      if @employee.save
---
SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "employees" ("created_at", "name", "post", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 19 Jun 2012 11:17:38 UTC +00:00], ["name", "Иванов Иван"], ["post", "Директор"], ["updated_at", Tue, 19 Jun 2012 11:17:38 UTC +00:00]]

  def update
    @employee = Employee.find(params[:id])

    respond_to do |format|
      if @employee.update_attributes(params[:employee])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "employees" SET "name" = 'Чилищев Гриша', "post" = 'Дворник', "updated_at" = '2012-06-19 13:03:05.919027' WHERE "employees"."id" = 2

  def destroy
    @employee = Employee.find(params[:id])
    if @employee.office.nil?
      @back = employees_path
    else
      @back = @employee.office
    end
    @employee.destroy
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 1]]