app/controllers/offices_controller.rb

  def index
    @offices = Office.all
---
SELECT "offices".* FROM "offices"

  def show
    @office = Office.find(params[:id])
---
SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @office = Office.find(params[:id])
---
SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @office = Office.new(params[:office])

    respond_to do |format|
      if @office.save
---
INSERT INTO "offices" ("address", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["address", "ул. Молодежная 143"], ["created_at", Tue, 19 Jun 2012 13:26:57 UTC +00:00], ["name", "ГУЭС"], ["updated_at", Tue, 19 Jun 2012 13:26:57 UTC +00:00]]

  def update
    @office = Office.find(params[:id])

    respond_to do |format|
      if @office.update_attributes(params[:office])
---
SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "offices" SET "name" = 'Узел электросвязи', "address" = 'пр-т Строителей 33', "updated_at" = '2012-06-22 06:50:55.933789' WHERE "offices"."id" = 3