app/controllers/visits_controller.rb

  def index
    if params[:employee_id].nil?
      if admin_signed_in?
        @visits = Visit.all
---
SELECT "visits".* FROM "visits"